       01 STRU05-RECORD.
          05 COM-ARRAY1 OCCURS 3 TIMES.
             10 COM-GROUP1.
                 15 COM-ARRAY2 OCCURS 2 TIMES.
                    20 COM-ARRAY3 OCCURS 5 TIMES PIC X.
